// 데이터
const personalData = [];
const genreData = [];
const feelData = [];

const queData = {
    0:["성별", "관심 분야", "오늘의 기분"],
    1:["본인의 성별을 선택해 주세요","관심있는 분야에 대해서 선택해 주세요.","오늘 하루의 기분이나 지금의 감정에 대해서 간략하게 설명해 주세요."]
}

const queID = {
    0:["gender"],
    1:["genre"],
    2:["feeling"]
}

const quedataOB = {
    0: ["선택 안함","남자","여자"],
    1: ["로맨스","SF","액션","무협","판타지","추리","스릴러","공포","게임"],
    2: [""]
}

const queDataValue = {
    0:[" ", "남성","여성"],
    1: ["로맨스","SF","액션","무협","판타지","추리","스릴러","공포","게임"],
    2:[""]
}
